
/**
 * 共通の定数定義
 */
export default {

  //----------------------------------------------------------
  // 数値の有効範囲
  //----------------------------------------------------------
  /** 整数の最小値. */
  INT_MIN: BigInt(-9223372036854775808n),
  /** 整数の最大値. */
  INT_MAX: BigInt(9223372036854775807n),

  //----------------------------------------------------------
  // 画面内スクロールのアンカー定義
  //----------------------------------------------------------
  /** ページトップ */
  ANCHOR_PAGE_TOP: "#anchor-page-top",

  //----------------------------------------------------------
  // 配列のフィールド名
  //----------------------------------------------------------
  FIELD_ACTION_MODE: "actionMode",
  FIELD_VALIDATION_TARGET: "validationTarget",
  FIELD_VALIDATION_CORRELATIONAL_TARGETS: "validationCorrelationalTargets",

  //----------------------------------------------------------
  // 動作モード
  // - 画面間でモードの受け渡しを行う時に利用する
  //
  // Notes: 画面固有の処理については画面側で定義すること
  //----------------------------------------------------------
  // 閲覧
  OPERATION_MODE_VIEW: 'view',
  // 新規登録
  OPERATION_MODE_NEW: 'new',
  // 編集
  OPERATION_MODE_EDIT: 'edit',
  // 削除
  OPERATION_MODE_DELETE: 'delete',
  // 複写登録（コピー）
  OPERATION_MODE_COPY: 'copy',

  //----------------------------------------------------------
  // アラート種別
  //----------------------------------------------------------
  // アラート：info
  ALERT_TYPE_INFO: "info",
  // アラート：error
  ALERT_TYPE_ERROR: "error",
  // アラート：warning
  ALERT_TYPE_WARNING: "warning",
  // アラート：alert
  ALERT_TYPE_ALERT: "alert",

  //----------------------------------------------------------
  // 項目の入力制御
  //----------------------------------------------------------
  /**
   * 検索項目の最大入力文字数（デフォルト）
   * - 項目固有の指定がな場合、デフォルトの最大文字数を設定する
   */
  SEARCH_ITEM_DEFAULT_MAX_LENGTH: 100,
}
